; domain
(define (domain emergency_services_logistics)

  (:requirements
    :strips
    :negative-preconditions
    :equality
    :typing
  )
  
  (:types 
    thing - object
    location
    robot deliverable person box - thing
    food medicine tools - deliverable)
    

  (:predicates
    (at ?t - thing ?l - location)    ;box/person/robot/deliverable is at location l
    (empty ?b - box)         ;box ?b is empty
    (filled ?b - box ?d - deliverable)  ;box ?b is filled with deliverable ?d         Assumption --> maximum one deliverable 
    (has_content ?p - person ?d - deliverable)     ;person ?p has deliverable ?d
    (loaded ?r - robot ?b - box)        ;robot ?r is loaded with box ?b
    (is_empty ?r - robot)           ;robot ?r is empty
  )

  ;; fill a box with a content
  (:action fill
    :parameters (?r - robot ?b - box ?d - deliverable ?l - location)
    :precondition (and
      (not (loaded ?r ?b))  ;Assumption --> we can fill a box only if it is not loaded on the robot
      (empty ?b)
      (at ?r ?l)
      (at ?d ?l)
      (at ?b ?l)
    )
    :effect (and
      (not (empty ?b))
      (filled ?b ?d)
      (not (at ?d ?l))
    )
  )
  
  ;; empty a box by leaving the content to the current location
  (:action empty_box
    :parameters (?r - robot ?b - box ?d - deliverable ?l - location)
    :precondition (and
      (not (empty ?b))
      (not (loaded ?r ?b))
      (at ?r ?l)          ;Assumption --> same location like fill
      (at ?b ?l)          ;Assumption --> same location like fill
      (filled ?b ?d)
    )
    :effect (and
      (empty ?b)
      (not (filled ?b ?d))
      (at ?d ?l)
    )
  )

  ;; serve a person in a specific location with a needed content
  (:action serve_person
    :parameters (?d - deliverable ?l - location ?p - person)
    :precondition (and
      (at ?p ?l)
      (at ?d ?l)
    )
    :effect (and
      (has_content ?p ?d)
    )
  )

  ;; pick up a single box and load it on the robotic agent, if it is at the same location as the box
  (:action load
    :parameters (?r - robot ?b - box ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?b ?l)
      (is_empty ?r)        ; Assumption 1 only
    )
    :effect (and
      (loaded ?r ?b)
      (not (is_empty ?r))
      (not (at ?b ?l))
    )
  )
  
  ;; move to another location moving the loaded box
  (:action move_with_box
    :parameters (?r - robot ?source - location ?destination - location ?b - box)
    :precondition (and
      (not (= ?source ?destination))
      (at ?r ?source)
      (loaded ?r ?b)
    )
    :effect (and
      (not (at ?r ?source))
      (at ?r ?destination)
    )
  )

  ;; move to another location without any box
  (:action move_without_box
    :parameters (?r - robot ?source - location ?destination - location)
    :precondition (and
      (not (= ?source ?destination))
      (at ?r ?source)
      (is_empty ?r)
    )
    :effect (and
      (not (at ?r ?source))
      (at ?r ?destination)
    )
  )
  
  ;; unload a single box and leave it on the location, if it is at the same location as the box
  (:action unload
    :parameters (?r - robot ?b - box ?l - location)
    :precondition (and
      (at ?r ?l)
      (loaded ?r ?b)
    )
    :effect (and
      (at ?b ?l)
      (not (loaded ?r ?b))
      (is_empty ?r)
    )
  )
)

; problem
(define (problem problem_1) (:domain emergency_services_logistics)
(:objects 
    depot loc1 loc2 - location
    alberto alessio stefano - person
    r1 - robot
    b1 - box
    banana apple - food
    aspirin - medicine
)

(:init
    ;box location
    (at b1 depot)
    (empty b1)

    ;robot location
    (at r1 depot)
    (is_empty r1)

    ;deliverable location
    (at banana depot)(at aspirin depot)(at apple depot)

    ;people location
    (at alessio loc1)(at stefano loc1)(at alberto loc2)
)

(:goal (and
    ;alessio needs banana
    (has_content alessio banana)

    ;stefano needs aspirin
    (has_content stefano aspirin)

    ;alberto needs banana
    (has_content alberto apple)
))
)

; plan
1. (fill r1 b1 apple depot)
   deleted: (empty b1) (at apple depot)
   added: (filled b1 apple)
   goals met: 0 of 3
2. (load r1 b1 depot)
   deleted: (is_empty r1) (at b1 depot)
   added: (loaded r1 b1)
   goals met: 0 of 3
3. (move_with_box r1 depot loc2 b1)
   deleted: (at r1 depot)
   added: (at r1 loc2)
   goals met: 0 of 3
4. (unload r1 b1 loc2)
   deleted: (loaded r1 b1)
   added: (at b1 loc2) (is_empty r1)
   goals met: 0 of 3
5. (empty_box r1 b1 apple loc2)
   deleted: (filled b1 apple)
   added: (empty b1) (at apple loc2)
   goals met: 0 of 3
6. (serve_person apple loc2 alberto)
   added: (has_content alberto apple)
   goals met: 1 of 3
7. (load r1 b1 loc2)
   deleted: (is_empty r1) (at b1 loc2)
   added: (loaded r1 b1)
   goals met: 1 of 3
8. (move_with_box r1 loc2 depot b1)
   deleted: (at r1 loc2)
   added: (at r1 depot)
   goals met: 1 of 3
9. (unload r1 b1 depot)
   deleted: (loaded r1 b1)
   added: (at b1 depot) (is_empty r1)
   goals met: 1 of 3
10. (fill r1 b1 aspirin depot)
   deleted: (empty b1) (at aspirin depot)
   added: (filled b1 aspirin)
   goals met: 1 of 3
11. (load r1 b1 depot)
   deleted: (is_empty r1) (at b1 depot)
   added: (loaded r1 b1)
   goals met: 1 of 3
12. (move_with_box r1 depot loc1 b1)
   deleted: (at r1 depot)
   added: (at r1 loc1)
   goals met: 1 of 3
13. (unload r1 b1 loc1)
   deleted: (loaded r1 b1)
   added: (at b1 loc1) (is_empty r1)
   goals met: 1 of 3
14. (empty_box r1 b1 aspirin loc1)
   deleted: (filled b1 aspirin)
   added: (empty b1) (at aspirin loc1)
   goals met: 1 of 3
15. (serve_person aspirin loc1 stefano)
   added: (has_content stefano aspirin)
   goals met: 2 of 3
16. (load r1 b1 loc1)
   deleted: (is_empty r1) (at b1 loc1)
   added: (loaded r1 b1)
   goals met: 2 of 3
17. (move_with_box r1 loc1 depot b1)
   deleted: (at r1 loc1)
   added: (at r1 depot)
   goals met: 2 of 3
18. (unload r1 b1 depot)
   deleted: (loaded r1 b1)
   added: (at b1 depot) (is_empty r1)
   goals met: 2 of 3
19. (fill r1 b1 banana depot)
   deleted: (empty b1) (at banana depot)
   added: (filled b1 banana)
   goals met: 2 of 3
20. (load r1 b1 depot)
   deleted: (is_empty r1) (at b1 depot)
   added: (loaded r1 b1)
   goals met: 2 of 3
21. (move_with_box r1 depot loc1 b1)
   deleted: (at r1 depot)
   added: (at r1 loc1)
   goals met: 2 of 3
22. (unload r1 b1 loc1)
   deleted: (loaded r1 b1)
   added: (at b1 loc1) (is_empty r1)
   goals met: 2 of 3
23. (empty_box r1 b1 banana loc1)
   deleted: (filled b1 banana)
   added: (empty b1) (at banana loc1)
   goals met: 2 of 3
24. (serve_person banana loc1 alessio)
   added: (has_content alessio banana)
   goals met: 3 of 3
